milindprajapati/RTOS_Workspace/STM32_HelloWorld/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "FreeRTOS.h"
#include "stm32f30x.h"
#include "stm32f3xx_nucleo.h"
#include "task.h"

TaskHandle_t xTaskHandle1=NULL;
TaskHandle_t xTaskHandle2=NULL;

void vTask1_handler(void  *params);
void vTask2_handler(void  *params);
/*
#ifdef USE_SEMIHOSTING
	extern void initialise_monitor_handles();
#endif
*/

static void prvSetupUart(void);
static void prvSetupHardware(void);
void printmsg(char  *msg);

//macros
#define TRUE 1
#define FALSE 0
#define AVAILABLE TRUE
#define NON_AVAILABLE FALSE

//GOBAL VARIABLE
uint8_t UART_ACCESS_KEY = AVAILABLE;
//========================================================
int main(void)
{/*
#ifdef USE_SEMIHOSTING
	initialise_monitor_handles();
	printf("This is Task creation Project\n");
#endif
*/
	RCC_DeInit();
	SystemCoreClockUpdate();
	prvSetupHardware();

	printmsg("Hello World! \n");
	//Create Task
	xTaskCreate( vTask1_handler, "Task1",configMINIMAL_STACK_SIZE, NULL, 2, &xTaskHandle1);
	xTaskCreate( vTask2_handler, "Task2",configMINIMAL_STACK_SIZE, NULL, 2, &xTaskHandle2);
	vTaskStartScheduler();
	for(;;);
}

void vTask1_handler(void  *params)
{
	while(1){
		if(UART_ACCESS_KEY == AVAILABLE)
		{
			UART_ACCESS_KEY = NON_AVAILABLE;
			printmsg("Hello World From Task-1! \r \n");
			UART_ACCESS_KEY = AVAILABLE;
			taskYIELD();
		}
	}
}

void vTask2_handler(void  *params)
{
	while(1){
		if(UART_ACCESS_KEY == AVAILABLE)
				{
					UART_ACCESS_KEY = NON_AVAILABLE;
					printmsg("Hello World From Task-2! \r \n");
					UART_ACCESS_KEY = AVAILABLE;
					taskYIELD();
				}
	}
}

static void prvSetupUart(void){

	GPIO_InitTypeDef gpio_uart_pins;
	USART_InitTypeDef uart2_init;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

	memset(&gpio_uart_pins,0,sizeof(gpio_uart_pins));
	gpio_uart_pins.GPIO_Pin = GPIO_Pin_2| GPIO_Pin_3;
	gpio_uart_pins.GPIO_Mode = GPIO_Mode_AF;
	gpio_uart_pins.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &gpio_uart_pins);

	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_7);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_7);

	memset(&uart2_init,0,sizeof(uart2_init));
	uart2_init.USART_BaudRate = 115200;
	uart2_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	uart2_init.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	uart2_init.USART_Parity = USART_Parity_No;
	uart2_init.USART_StopBits = USART_StopBits_1;
	uart2_init.USART_WordLength = USART_WordLength_8b;

	USART_Init(USART2,&uart2_init);

	USART_Cmd(USART2, ENABLE);
}

static void prvSetupHardware(void){
	//Uart Call
	prvSetupUart();
}

void printmsg(char  *msg){
	for(uint32_t i=0;i<strlen(msg);i++){
		while(USART_GetFlagStatus(USART2, USART_FLAG_TXE)!=SET);
		USART_SendData(USART2, msg[i]);
	}
	while ( USART_GetFlagStatus(USART2,USART_FLAG_TC) != SET);
}
